In [1]:
import pandas as pd
df = pd.read_excel('score.xlsx', index_col='번호')
df

     이름  주소  나이   점수      언어
번호
1번  김길동  광주  33   76  Python
2번  이길동  서울  23   88    Java
3번  강길동  대구  30   98     C++
4번  홍길동  대전  20  100     NaN
5번  박길동  광주  21   60     NaN
6번  나길동  서울  25   90       C

In [2]:
import pandas as pd
df = pd.read_excel('score.xlsx', index_col='번호')
df

     이름  주소  나이   점수      언어
번호
1번  김길동  광주  33   76  Python
2번  이길동  서울  23   88    Java
3번  강길동  대구  30   98     C++
4번  홍길동  대전  20  100     NaN
5번  박길동  광주  21   60     NaN
6번  나길동  서울  25   90       C

- column 수정

In [2]:
df['주소'].replace({'광주':'광주전남'})

번호
1번    광주전남
2번      서울
3번      대구
4번      대전
5번    광주전남
6번      서울
Name: 주소, dtype: object

In [4]:
df['주소'].replace({'광주':'광주광역시'})

번호
1번    광주광역시
2번       서울
3번       대구
4번       대전
5번    광주광역시
6번       서울
Name: 주소, dtype: object

In [6]:
df['주소'] = df['주소'].replace({'광주':'광주광역시','서울':'서울특별시','대구':'대구광역시','대전':'대전광역시'})

In [7]:
df['주소']

번호
1번    광주광역시
2번    서울특별시
3번    대구광역시
4번    대전광역시
5번    광주광역시
6번    서울특별시
Name: 주소, dtype: object

In [8]:
df

     이름     주소  나이   점수      언어
번호
1번  김길동  광주광역시  33   76  Python
2번  이길동  서울특별시  23   88    Java
3번  강길동  대구광역시  30   98     C++
4번  홍길동  대전광역시  20  100     NaN
5번  박길동  광주광역시  21   60     NaN
6번  나길동  서울특별시  25   90       C

In [9]:
df['언어'] = df['언어'].str.lower()
df

     이름     주소  나이   점수      언어
번호
1번  김길동  광주광역시  33   76  python
2번  이길동  서울특별시  23   88    java
3번  강길동  대구광역시  30   98     c++
4번  홍길동  대전광역시  20  100     NaN
5번  박길동  광주광역시  21   60     NaN
6번  나길동  서울특별시  25   90       c

In [10]:
df['언어'] = df['언어'].str.upper()
df

     이름     주소  나이   점수      언어
번호
1번  김길동  광주광역시  33   76  PYTHON
2번  이길동  서울특별시  23   88    JAVA
3번  강길동  대구광역시  30   98     C++
4번  홍길동  대전광역시  20  100     NaN
5번  박길동  광주광역시  21   60     NaN
6번  나길동  서울특별시  25   90       C

In [6]:
df['언어'] = df['언어'].str.upper()
df

     이름  주소  나이   점수      언어
번호
1번  김길동  광주  33   76  PYTHON
2번  이길동  서울  23   88    JAVA
3번  강길동  대구  30   98     C++
4번  홍길동  대전  20  100     NaN
5번  박길동  광주  21   60     NaN
6번  나길동  서울  25   90       C

In [45]:
df['주소'] = df['주소'] + '시'
df

         이름       주소  나이   점수      언어    총합  결과  사람
번호
1번  한주얼리크로스  광주광역시해시  31  -76  한국어조금? -2356  과락  아님
2번      이길동  서울특별시해시  23   88    JAVA  2024  통과  맞음
3번      강길동  대구광역시해시  30   98     C++  2940  통과  맞음
4번      홍길동  대전광역시해시  20  100     NaN  2000  통과  맞음
5번      박길동  광주광역시해시  21   60     NaN  1260  통과  맞음
6번      나길동  서울특별시해시  25   90       C  2250  통과  맞음

In [48]:
df['주소'] = df['주소'] +'시'
df

         이름     주소  나이   점수      언어    총합  결과  사람
번호
1번  한주얼리크로스  광주광역시  31  -76  한국어조금? -2356  과락  아님
2번      이길동  서울특별시  23   88    JAVA  2024  통과  맞음
3번      강길동  대구광역시  30   98     C++  2940  통과  맞음
4번      홍길동  대전광역시  20  100     NaN  2000  통과  맞음
5번      박길동  광주광역시  21   60     NaN  1260  통과  맞음
6번      나길동  서울특별시  25   90       C  2250  통과  맞음

In [65]:
df['점수'] = df['점수'].str.rstrip('점점점점')
df

         이름    주소  나이   점수      언어   총합  결과  사람
번호
1번  한주얼리크로스  광주광역  31  -76  한국어조금?  -45  과락  아님
2번      이길동  서울특별  23   88    JAVA  111  통과  맞음
3번      강길동  대구광역  30   98     C++  128  통과  맞음
4번      홍길동  대전광역  20  100     NaN  120  통과  맞음
5번      박길동  광주광역  21   60     NaN   81  통과  맞음
6번      나길동  서울특별  25   90       C  115  통과  맞음

In [66]:
df['점수'] = df['점수'].astype(str)+'점'
df

         이름    주소  나이    점수      언어   총합  결과  사람
번호
1번  한주얼리크로스  광주광역  31  -76점  한국어조금?  -45  과락  아님
2번      이길동  서울특별  23   88점    JAVA  111  통과  맞음
3번      강길동  대구광역  30   98점     C++  128  통과  맞음
4번      홍길동  대전광역  20  100점     NaN  120  통과  맞음
5번      박길동  광주광역  21   60점     NaN   81  통과  맞음
6번      나길동  서울특별  25   90점       C  115  통과  맞음

In [70]:
df['점수'] = df['점수'].apply(lambda x : str(x) + '점')
df

         이름    주소  나이     점수      언어   총합  결과  사람
번호
1번  한주얼리크로스  광주광역  31  -76점점  한국어조금?  -45  과락  아님
2번      이길동  서울특별  23   88점점    JAVA  111  통과  맞음
3번      강길동  대구광역  30   98점점     C++  128  통과  맞음
4번      홍길동  대전광역  20  100점점     NaN  120  통과  맞음
5번      박길동  광주광역  21   60점점     NaN   81  통과  맞음
6번      나길동  서울특별  25   90점점       C  115  통과  맞음

In [72]:
df['점수'] = df['점수'].apply(lambda x : f"{x}점")
df

         이름    주소  나이      점수      언어   총합  결과  사람
번호
1번  한주얼리크로스  광주광역  31  f{x}점점  한국어조금?  -45  과락  아님
2번      이길동  서울특별  23  f{x}점점    JAVA  111  통과  맞음
3번      강길동  대구광역  30  f{x}점점     C++  128  통과  맞음
4번      홍길동  대전광역  20  f{x}점점     NaN  120  통과  맞음
5번      박길동  광주광역  21  f{x}점점     NaN   81  통과  맞음
6번      나길동  서울특별  25  f{x}점점       C  115  통과  맞음

In [73]:
df = pd.read_excel('score.xlsx', index_col='번호')
df

     이름  주소  나이   점수      언어
번호
1번  김길동  광주  33   76  Python
2번  이길동  서울  23   88    Java
3번  강길동  대구  30   98     C++
4번  홍길동  대전  20  100     NaN
5번  박길동  광주  21   60     NaN
6번  나길동  서울  25   90       C

In [74]:
df['점수'] = df['점수'].apply(lambda x : f"{x}점")
df

     이름  주소  나이    점수      언어
번호
1번  김길동  광주  33   76점  Python
2번  이길동  서울  23   88점    Java
3번  강길동  대구  30   98점     C++
4번  홍길동  대전  20  100점     NaN
5번  박길동  광주  21   60점     NaN
6번  나길동  서울  25   90점       C

In [81]:
df['점수'] = df['점수'].str.rstrip('점')
df

     이름  주소  나이   점수      언어
번호
1번  김길동  광주  33   76  Python
2번  이길동  서울  23   88    Java
3번  강길동  대구  30   98     C++
4번  홍길동  대전  20  100     NaN
5번  박길동  광주  21   60     NaN
6번  나길동  서울  25   90       C

In [88]:
df['점수'] = df['점수'].astype(int)
df

     이름  주소  나이   점수      언어  결과
번호
1번  김길동  광주  33   76  Python  보류
2번  이길동  서울  23   88    Java  보류
3번  강길동  대구  30   98     C++  보류
4번  홍길동  대전  20  100     NaN  보류
5번  박길동  광주  21   60     NaN  보류
6번  나길동  서울  25   90       C  보류

In [91]:
df['결과'] = 'fail'
df

     이름  주소  나이   점수      언어    결과
번호
1번  김길동  광주  33   76  Python  fail
2번  이길동  서울  23   88    Java  fail
3번  강길동  대구  30   98     C++  fail
4번  홍길동  대전  20  100     NaN  fail
5번  박길동  광주  21   60     NaN  fail
6번  나길동  서울  25   90       C  fail

In [95]:
df.loc[(df['점수']>70) & (df['점수']<90), '결과'] = '보류'
df

     이름  주소  나이   점수      언어    결과
번호
1번  김길동  광주  33   76  Python    보류
2번  이길동  서울  23   88    Java    보류
3번  강길동  대구  30   98     C++  fail
4번  홍길동  대전  20  100     NaN  fail
5번  박길동  광주  21   60     NaN  fail
6번  나길동  서울  25   90       C  fail

In [97]:
df['점수표시용']=df['점수'].astype(str) + '점'
df

     이름  주소  나이   점수      언어    결과 점수표시용
번호
1번  김길동  광주  33   76  Python    보류   76점
2번  이길동  서울  23   88    Java    보류   88점
3번  강길동  대구  30   98     C++  fail   98점
4번  홍길동  대전  20  100     NaN  fail  100점
5번  박길동  광주  21   60     NaN  fail   60점
6번  나길동  서울  25   90       C  fail   90점

In [52]:
str(5)+'시'

'5시'

In [51]:
df['주소'] = df['주소'].str.rstrip('시')
df['주소']

번호
1번    광주광역
2번    서울특별
3번    대구광역
4번    대전광역
5번    광주광역
6번    서울특별
Name: 주소, dtype: object

In [98]:
df.columns

Index(['이름', '주소', '나이', '점수', '언어', '결과', '점수표시용'], dtype='object')

In [104]:
cols = list(df.columns)
cols.insert(3, cols.pop(cols.index('점수표시용')))
df = df[cols]
df

     이름  주소   점수 점수표시용  나이      언어    결과
번호
1번  김길동  광주   76   76점  33  Python    보류
2번  이길동  서울   88   88점  23    Java    보류
3번  강길동  대구   98   98점  30     C++  fail
4번  홍길동  대전  100  100점  20     NaN  fail
5번  박길동  광주   60   60점  21     NaN  fail
6번  나길동  서울   90   90점  25       C  fail

#### column 추가

In [54]:
df['총합'] = df['나이'] + df['점수']
df

         이름    주소  나이   점수      언어   총합  결과  사람
번호
1번  한주얼리크로스  광주광역  31  -76  한국어조금?  -45  과락  아님
2번      이길동  서울특별  23   88    JAVA  111  통과  맞음
3번      강길동  대구광역  30   98     C++  128  통과  맞음
4번      홍길동  대전광역  20  100     NaN  120  통과  맞음
5번      박길동  광주광역  21   60     NaN   81  통과  맞음
6번      나길동  서울특별  25   90       C  115  통과  맞음

In [55]:
df['이름'] = df['이름'].replace({'김길동':'한주얼리크로스'})
df['나이'] = df['나이'].replace({33:31})
df['점수'] = df['점수'].replace({76:-76})
df['언어'] = df['언어'].replace({'PYTHON':'한국어조금?'})
df

         이름    주소  나이   점수      언어   총합  결과  사람
번호
1번  한주얼리크로스  광주광역  31  -76  한국어조금?  -45  과락  아님
2번      이길동  서울특별  23   88    JAVA  111  통과  맞음
3번      강길동  대구광역  30   98     C++  128  통과  맞음
4번      홍길동  대전광역  20  100     NaN  120  통과  맞음
5번      박길동  광주광역  21   60     NaN   81  통과  맞음
6번      나길동  서울특별  25   90       C  115  통과  맞음

In [29]:
df['결과'] = '과락'

In [32]:
df

         이름        주소  나이   점수      언어    총합  결과
번호
1번  한주얼리크로스  광주광역시시시해  31  -76  한국어조금? -2356  과락
2번      이길동  서울특별시시시해  23   88    JAVA  2024  과락
3번      강길동  대구광역시시시해  30   98     C++  2940  과락
4번      홍길동  대전광역시시시해  20  100     NaN  2000  과락
5번      박길동  광주광역시시시해  21   60     NaN  1260  과락
6번      나길동  서울특별시시시해  25   90       C  2250  과락

In [33]:
df.loc[df['총합']>200, '결과'] = '통과'
df

         이름        주소  나이   점수      언어    총합  결과
번호
1번  한주얼리크로스  광주광역시시시해  31  -76  한국어조금? -2356  과락
2번      이길동  서울특별시시시해  23   88    JAVA  2024  통과
3번      강길동  대구광역시시시해  30   98     C++  2940  통과
4번      홍길동  대전광역시시시해  20  100     NaN  2000  통과
5번      박길동  광주광역시시시해  21   60     NaN  1260  통과
6번      나길동  서울특별시시시해  25   90       C  2250  통과

In [36]:
df['사람'] ='아님'
df
df.loc[df['총합']>1000, '사람'] = '맞음'
df

         이름        주소  나이   점수      언어    총합  결과  사람
번호
1번  한주얼리크로스  광주광역시시시해  31  -76  한국어조금? -2356  과락  아님
2번      이길동  서울특별시시시해  23   88    JAVA  2024  통과  맞음
3번      강길동  대구광역시시시해  30   98     C++  2940  통과  맞음
4번      홍길동  대전광역시시시해  20  100     NaN  2000  통과  맞음
5번      박길동  광주광역시시시해  21   60     NaN  1260  통과  맞음
6번      나길동  서울특별시시시해  25   90       C  2250  통과  맞음

In [11]:
df.loc[df['총합']>2200 , '결과'] = 'Pass'
df

     이름   주소  나이   점수      언어    총합    결과
번호
1번  김길동  광주시  33   76  PYTHON  2508  Pass
2번  이길동  서울시  23   88    JAVA  2024  Fail
3번  강길동  대구시  30   98     C++  2940  Pass
4번  홍길동  대전시  20  100     NaN  2000  Fail
5번  박길동  광주시  21   60     NaN  1260  Fail
6번  나길동  서울시  25   90       C  2250  Pass

#### column 삭제

In [57]:
df.drop(columns=['총합','결과'])
df

         이름    주소  나이   점수      언어   총합  결과  사람
번호
1번  한주얼리크로스  광주광역  31  -76  한국어조금?  -45  과락  아님
2번      이길동  서울특별  23   88    JAVA  111  통과  맞음
3번      강길동  대구광역  30   98     C++  128  통과  맞음
4번      홍길동  대전광역  20  100     NaN  120  통과  맞음
5번      박길동  광주광역  21   60     NaN   81  통과  맞음
6번      나길동  서울특별  25   90       C  115  통과  맞음

In [13]:
df

     이름   주소  나이   점수      언어    총합    결과
번호
1번  김길동  광주시  33   76  PYTHON  2508  Pass
2번  이길동  서울시  23   88    JAVA  2024  Fail
3번  강길동  대구시  30   98     C++  2940  Pass
4번  홍길동  대전시  20  100     NaN  2000  Fail
5번  박길동  광주시  21   60     NaN  1260  Fail
6번  나길동  서울시  25   90       C  2250  Pass

#### row 삭제

In [15]:
df.drop(index='4번')

     이름   주소  나이  점수      언어    총합    결과
번호
1번  김길동  광주시  33  76  PYTHON  2508  Pass
2번  이길동  서울시  23  88    JAVA  2024  Fail
3번  강길동  대구시  30  98     C++  2940  Pass
5번  박길동  광주시  21  60     NaN  1260  Fail
6번  나길동  서울시  25  90       C  2250  Pass

In [16]:
df

     이름   주소  나이   점수      언어    총합    결과
번호
1번  김길동  광주시  33   76  PYTHON  2508  Pass
2번  이길동  서울시  23   88    JAVA  2024  Fail
3번  강길동  대구시  30   98     C++  2940  Pass
4번  홍길동  대전시  20  100     NaN  2000  Fail
5번  박길동  광주시  21   60     NaN  1260  Fail
6번  나길동  서울시  25   90       C  2250  Pass

In [58]:
cond = df['점수']<80
df[cond]

         이름    주소  나이  점수      언어  총합  결과  사람
번호
1번  한주얼리크로스  광주광역  31 -76  한국어조금? -45  과락  아님
5번      박길동  광주광역  21  60     NaN  81  통과  맞음

In [59]:
df[~cond]

     이름    주소  나이   점수    언어   총합  결과  사람
번호
2번  이길동  서울특별  23   88  JAVA  111  통과  맞음
3번  강길동  대구광역  30   98   C++  128  통과  맞음
4번  홍길동  대전광역  20  100   NaN  120  통과  맞음
6번  나길동  서울특별  25   90     C  115  통과  맞음

In [19]:
df[cond].index

Index(['1번', '5번'], dtype='object', name='번호')

In [20]:
df.drop(index=df[cond].index)

     이름   주소  나이   점수    언어    총합    결과
번호
2번  이길동  서울시  23   88  JAVA  2024  Fail
3번  강길동  대구시  30   98   C++  2940  Pass
4번  홍길동  대전시  20  100   NaN  2000  Fail
6번  나길동  서울시  25   90     C  2250  Pass